УчетВУправляющихДляГит1/src/Catalogs/МакетыПенсионныхДел/МакетыПенсионныхДел.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МакетыПенсионныхДел</name>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Вспомогательное поле для реализации отбора по организации</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.ОрганыПФР</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыходаНаПенсию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Стаж</name>
    <type>
      <types>EnumRef.ВидыСтажаДляНазначенияПенсии</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>DefinedType.СотрудникМакетПенсионногоДела</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганПФРПоМестуНазначенияПенсии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтраховойНомерПФР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресРегистрации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыПерепискиСКонтролирующимиОрганами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЭлектронныеДокументы</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>CatalogRef.МакетыПенсионныхДелПрисоединенныеФайлы</types>
      </type>
    </attributes>
    <attributes>
      <name>Страница1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Страница2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УчетВУправляющихДляГит1/src/Catalogs/МакетыПенсионныхДел/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

Функция ПолучитьТекстовоеВложение(Ссылка, ИмяФайла) Экспорт
	
	// получаем вложение
	СтрВложения = КонтекстЭДО().ПолучитьВложения(Ссылка, ИмяФайла);
	Если СтрВложения.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	СтрВложение = СтрВложения[0];
	
	// сохраняем вложение на диск
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	СтрВложение.Данные.Получить().Записать(ИмяВременногоФайла);
	
	// считываем при помощи ЧтениеТекста, чтобы автоматически распозналась кодировка UTF? или ANSI
	ОбъектЧтение = Новый ЧтениеТекста(ИмяВременногоФайла);
	СтрТекст = ОбъектЧтение.Прочитать();
	ОбъектЧтение.Закрыть();
	
	// удаляем временный файл
	УдалитьФайлы(ИмяВременногоФайла);
	
	Возврат СтрТекст;
	
КонецФункции

Функция ПолучитьВложениеНаСервере(Ссылка, ИмяФайла, Идентификатор) Экспорт
	
	СтрВложения = КонтекстЭДО().ПолучитьВложения(Ссылка, ИмяФайла);
	Если СтрВложения.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Вложение = СтрВложения[0];
	
	Возврат ПоместитьВоВременноеХранилище(Вложение.Данные.Получить(), Идентификатор);

КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#Область ПроцедурыИФункцииПечати

// Функция формирует табличный документ с печатной формой
Функция ПечатьРеестраДокументов(МассивОбъектов, ОбъектыПечати)

	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб				= Истина;
	ТабличныйДокумент.КлючПараметровПечати		= "ПАРАМЕТРЫ_ПЕЧАТИ_РеестрДокументов_МакетыПенсионныхДел";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.МакетыПенсионныхДел.ПФ_MXL_РеестрДокументов");

	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивСсылок", МассивОбъектов);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МакетыПенсионныхДелЭлектронныеДокументы.Файл КАК КоличествоЛистов,
	|	МакетыПенсионныхДелЭлектронныеДокументы.Ссылка.ФИО КАК Сотрудник,
	|	МакетыПенсионныхДелЭлектронныеДокументы.Ссылка.Организация КАК Организация,
	|	МакетыПенсионныхДелЭлектронныеДокументы.Ссылка.СтраховойНомерПФР КАК СНИЛС,
	|	МакетыПенсионныхДелЭлектронныеДокументы.Ссылка.АдресРегистрации КАК АдресРегистрации,
	|	МакетыПенсионныхДелЭлектронныеДокументы.Документ КАК Документ,
	|	МакетыПенсионныхДелЭлектронныеДокументы.Ссылка.Телефон КАК Телефон,
	|	МакетыПенсионныхДелЭлектронныеДокументы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.МакетыПенсионныхДел.ЭлектронныеДокументы КАК МакетыПенсионныхДелЭлектронныеДокументы
	|ГДЕ
	|	МакетыПенсионныхДелЭлектронныеДокументы.Ссылка В(&МассивСсылок)
	|	И МакетыПенсионныхДелЭлектронныеДокументы.Файл <> ЗНАЧЕНИЕ(Справочник.МакетыПенсионныхДелПрисоединенныеФайлы.ПустаяСсылка)
	|	И МакетыПенсионныхДелЭлектронныеДокументы.Документ <> ""Реестр""
	|
	|УПОРЯДОЧИТЬ ПО
	|	Документ
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КоличествоЛистов)
	|ПО
	|	Ссылка,
	|	Документ";
	
	ВыборкаСсылка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаСсылка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ШапкаВыведена = Ложь;
		
		ВыборкаДокумент = ВыборкаСсылка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ПорядковыйНомер = 1;
		Пока ВыборкаДокумент.Следующий() Цикл
			Если Не ШапкаВыведена Тогда
				ОбластьШапка.Параметры.Заполнить(ВыборкаДокумент);
				Если ЗначениеЗаполнено(ВыборкаДокумент.Телефон) Тогда
					АдресИТелефон = СтрШаблон("%1
                                               |тел. %2", ВыборкаДокумент.АдресРегистрации, ВыборкаДокумент.Телефон);
				Иначе
					АдресИТелефон = СтрШаблон("%1", ВыборкаДокумент.АдресРегистрации);
				КонецЕсли;									   				
				ОбластьШапка.Параметры.АдресРегистрацииИТелефон = АдресИТелефон;
				
				РеквизитыОрганизации = "РегНомПФР, ТелОрганизации, НаимЮЛПол";				
				СтруктураДанныхОрганизации = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(ВыборкаДокумент.Организация,, РеквизитыОрганизации);
				ОбластьШапка.Параметры.Организация = СтруктураДанныхОрганизации.НаимЮЛПол;
				ОбластьШапка.Параметры.РегистрационныйНомерПФР = СтруктураДанныхОрганизации.РегНомПФР;
				ТабличныйДокумент.Вывести(ОбластьШапка);
				ШапкаВыведена = Истина;
			КонецЕсли;
			ОбластьСтрока.Параметры.ПорядковыйНомер = ПорядковыйНомер;
			ОбластьСтрока.Параметры.Документ = ВыборкаДокумент.Документ;
			ОбластьСтрока.Параметры.КоличествоЛистов = ВыборкаДокумент.КоличествоЛистов;
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			
			ПорядковыйНомер = ПорядковыйНомер + 1;
		КонецЦикла;
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		ТабличныйДокумент.ТолькоПросмотр = Истина;
		
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, ВыборкаСсылка.Ссылка);

	КонецЦикла;

	Возврат ТабличныйДокумент;

КонецФункции

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РеестрДокументов") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "РеестрДокументов", "Реестр документов",
			ПечатьРеестраДокументов(МассивОбъектов, ОбъектыПечати), , "Справочник.МакетыПенсионныхДел.ПФ_MXL_РеестрДокументов");
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

Функция КонтекстЭДО()
	
	Возврат ДокументооборотСКОВызовСервера.ПолучитьОбработкуЭДО();
	
КонецФункции

#КонецОбласти

#КонецЕсли
